import React from "react";
import { Formik, Form  } from "formik";
import DefaultInput from "../../../components/ReusableComponents/DefaultInput";
import { AddressSchema } from "../../../config/yupConfig";
import registrationStore from "../RegistrationStore";
import classes from "../Registration.module.css";
import TextField from "@material-ui/core/TextField";
import Autocomplete from "@material-ui/lab/Autocomplete";
export default function AddressInfo() {
  return (
    <div>
      <h1 className={classes.h1}>Адрес</h1>
      <div className={classes["form-wrapper"]}>
        <Formik
          initialValues={{
            city: "",
            location: ""
          }}
          validationSchema={AddressSchema}
          onSubmit={(values, { resetForm }) => {
            registrationStore.changePage(values, "paymentInfo");
          }}
          render={({ errors, touched }) => (
            <Form>
              <DefaultInput
                label="Город"
                name="city"
                type="select"
                errors={errors}
                touched={touched}
              />
              <DefaultInput
                label="Адрес"
                name="location"
                type="text"
                errors={errors}
                touched={touched}
              />
              {/* <Autocomplete
                id="country-select-demo"
                style={{ width: 300 }}
                options={countries}
                classes={{
                  option: classes.option
                }}
                autoHighlight
                getOptionLabel={option => option.label}
                renderOption={option => (
                  <React.Fragment>{option.label}</React.Fragment>
                )}
                renderInput={params => (
                  <TextField
                    {...params}
                    label="Choose a country"
                    variant="outlined"
                    inputProps={{
                      ...params.inputProps,
                      autoComplete: "new-password" // disable autocomplete and autofill
                    }}
                  />
                )}
              /> */}
              <button type="submit" className={classes.btn}>
                Следующий шаг
              </button>
            </Form>
          )}
        />
      </div>
    </div>
  );
}

const countries = [
  {
    label: "Алупка",
    lat: "44.4197222",
    lng: "34.0430556"
  },
  {
    label: "Алушта",
    lat: "44.6637211",
    lng: "34.405013"
  },
  {
    label: "Армянск",
    lat: "46.1072222",
    lng: "33.6933333"
  },
  {
    label: "Бахчисарай",
    lat: "44.7527778",
    lng: "33.8608333"
  },
  {
    label: "Белогорск",
    lat: "45.0544444",
    lng: "34.6022222"
  },
  {
    label: "Джанкой",
    lat: "45.7086111",
    lng: "34.3933333"
  },
  {
    label: "Евпатория",
    lat: "45.2036111",
    lng: "33.3613889"
  },
  {
    label: "Керчь",
    lat: "45.33786",
    lng: "36.458401"
  },
  {
    label: "Красноперекопск",
    lat: "45.962849",
    lng: "33.787121"
  },
  {
    label: "Саки",
    lat: "45.1336111",
    lng: "33.5772222"
  },
  {
    label: "Севастополь",
    lat: "44.60000001",
    lng: "33.533333343333"
  },
  {
    label: "Симферополь",
    lat: "44.9480556",
    lng: "34.1041667"
  },
  {
    label: "Старый Крым",
    lat: "45.0291667",
    lng: "35.0886111"
  },
  {
    label: "Судак",
    lat: "44.858799",
    lng: "34.974979"
  },
  {
    label: "Феодосия",
    lat: "45.0488889",
    lng: "35.3791667"
  },
  {
    label: "Щёлкино",
    lat: "45.4281023",
    lng: "35.8165187"
  },
  {
    label: "Ялта",
    lat: "44.4994444",
    lng: "34.1552778"
  },
  {
    label: "Бар",
    lat: "49.630283",
    lng: "27.001648"
  },
  {
    label: "Бершадь",
    lat: "48.368954",
    lng: "29.5331654"
  },
  {
    label: "Винница",
    lat: "49.2333333",
    lng: "28.4833333"
  },
  {
    label: "Гайсин",
    lat: "48.8094444",
    lng: "29.3905556"
  },
  {
    label: "Жмеринка",
    lat: "49.038349",
    lng: "28.10556"
  },
  {
    label: "Казатин",
    lat: "49.711769",
    lng: "28.842859"
  },
  {
    label: "Калиновка",
    lat: "49.4472222",
    lng: "28.5230556"
  },
  {
    label: "Ладыжин",
    lat: "48.676151",
    lng: "29.262541"
  },
  {
    label: "Могилёв-Подольский",
    lat: "48.45",
    lng: "27.8"
  },
  {
    label: "Немиров",
    lat: "48.9726621",
    lng: "28.835666"
  },
  {
    label: "Погребище",
    lat: "49.4833333",
    lng: "29.2666667"
  },
  {
    label: "Тульчин",
    lat: "48.68",
    lng: "28.87"
  },
  {
    label: "Хмельник",
    lat: "49.563469",
    lng: "27.959379"
  },
  {
    label: "Шаргород",
    lat: "48.73761",
    lng: "28.08688"
  },
  {
    label: "Ямполь",
    lat: "49.9572775",
    lng: "26.2290711"
  },
  {
    label: "Берестечко",
    lat: "50.3505636",
    lng: "25.1007738"
  },
  {
    label: "Владимир-Волынский",
    lat: "50.853578",
    lng: "24.311783"
  },
  {
    label: "Горохов",
    lat: "50.500622",
    lng: "24.767559"
  },
  {
    label: "Камень-Каширский",
    lat: "51.6241667",
    lng: "24.9605556"
  },
  {
    label: "Киверцы",
    lat: "50.833621",
    lng: "25.460706"
  },
  {
    label: "Ковель",
    lat: "51.212898",
    lng: "24.71343"
  },
  {
    label: "Луцк",
    lat: "50.75",
    lng: "25.3358333"
  },
  {
    label: "Любомль",
    lat: "51.2230556",
    lng: "24.0377778"
  },
  {
    label: "Нововолынск",
    lat: "50.7333333",
    lng: "24.1666667"
  },
  {
    label: "Рожище",
    lat: "50.915901",
    lng: "25.268551"
  },
  {
    label: "Устилуг",
    lat: "50.86",
    lng: "24.15"
  },
  {
    label: "Апостолово",
    lat: "47.65815",
    lng: "33.697819"
  },
  {
    label: "Верхнеднепровск",
    lat: "48.6561111",
    lng: "34.3283333"
  },
  {
    label: "Вольногорск",
    lat: "48.4833333",
    lng: "34.0166667"
  },
  {
    label: "Днепродзержинск",
    lat: "48.5166667",
    lng: "34.6166667"
  },
  {
    label: "Днепропетровск",
    lat: "48.45",
    lng: "34.9833333"
  },
  {
    label: "Жёлтые Воды",
    lat: "48.35",
    lng: "33.5"
  },
  {
    label: "Кривой Рог",
    lat: "47.899726",
    lng: "33.379534"
  },
  {
    label: "Марганец",
    lat: "47.6397222",
    lng: "34.6363889"
  },
  {
    label: "Никополь",
    lat: "47.5666667",
    lng: "34.4"
  },
  {
    label: "Новомосковск",
    lat: "48.6333333",
    lng: "35.2166667"
  },
  {
    label: "Орджоникидзе",
    lat: "44.9643961",
    lng: "35.3569007"
  },
  {
    label: "Павлоград",
    lat: "48.533939",
    lng: "35.869282"
  },
  {
    label: "Перещепино",
    lat: "49.016251",
    lng: "35.371681"
  },
  {
    label: "Першотравенск",
    lat: "48.3463889",
    lng: "36.4044444"
  },
  {
    label: "Подгородное",
    lat: "49.5355598",
    lng: "25.5276081"
  },
  {
    label: "Пятихатки",
    lat: "48.4113889",
    lng: "33.7105556"
  },
  {
    label: "Синельниково",
    lat: "48.3177778",
    lng: "35.5119444"
  },
  {
    label: "Терновка",
    lat: "48.5402778",
    lng: "29.9677778"
  },
  {
    label: "Авдеевка",
    lat: "48.1333333",
    lng: "37.7333333"
  },
  {
    label: "Артёмовск",
    lat: "48.599072",
    lng: "37.999241"
  },
  {
    label: "Волноваха",
    lat: "47.596119",
    lng: "37.490429"
  },
  {
    label: "Горловка",
    lat: "48.346432",
    lng: "38.059513"
  },
  {
    label: "Дзержинск",
    lat: "48.4",
    lng: "37.8333333"
  },
  {
    label: "Дебальцево",
    lat: "48.3333333",
    lng: "38.4"
  },
  {
    label: "Димитров",
    lat: "48.32357",
    lng: "37.291854"
  },
  {
    label: "Доброполье",
    lat: "48.4691324",
    lng: "37.0871223"
  },
  {
    label: "Докучаевск",
    lat: "47.770821",
    lng: "37.684361"
  },
  {
    label: "Донецк",
    lat: "48.0027778",
    lng: "37.8052778"
  },
  {
    label: "Дружковка",
    lat: "48.6166667",
    lng: "37.5333333"
  },
  {
    label: "Енакиево",
    lat: "48.2166667",
    lng: "38.2"
  },
  {
    label: "Ждановка",
    lat: "48.1462985",
    lng: "38.2540176"
  },
  {
    label: "Зугрэс",
    lat: "48.0166667",
    lng: "38.2666667"
  },
  {
    label: "Кировское",
    lat: "48.15",
    lng: "38.3666667"
  },
  {
    label: "Краматорск",
    lat: "48.736462",
    lng: "37.57164"
  },
  {
    label: "Красноармейск",
    lat: "48.2827778",
    lng: "37.1827778"
  },
  {
    label: "Красный Лиман",
    lat: "48.984211",
    lng: "37.810329"
  },
  {
    label: "Константиновка",
    lat: "48.51545",
    lng: "37.703629"
  },
  {
    label: "Мариуполь",
    lat: "47.1166667",
    lng: "37.55"
  },
  {
    label: "Макеевка",
    lat: "48.076179",
    lng: "38.068427"
  },
  {
    label: "Новогродовка",
    lat: "48.2045408",
    lng: "37.336821"
  },
  {
    label: "Селидово",
    lat: "48.144671",
    lng: "37.297897"
  },
  {
    label: "Славянск",
    lat: "48.846851",
    lng: "37.57954"
  },
  {
    label: "Снежное",
    lat: "48.0282789",
    lng: "38.7656122"
  },
  {
    label: "Соледар",
    lat: "48.6833333",
    lng: "38.1"
  },
  {
    label: "Торез",
    lat: "48.0166667",
    lng: "38.6333333"
  },
  {
    label: "Угледар",
    lat: "47.7833333",
    lng: "37.25"
  },
  {
    label: "Харцызск",
    lat: "48.037411",
    lng: "38.160301"
  },
  {
    label: "Шахтёрск",
    lat: "48.0333333",
    lng: "38.4833333"
  },
  {
    label: "Ясиноватая",
    lat: "48.1221425",
    lng: "37.8765944"
  },
  {
    label: "Андрушёвка",
    lat: "50.0166667",
    lng: "29.0166667"
  },
  {
    label: "Барановка",
    lat: "50.30204",
    lng: "27.67634"
  },
  {
    label: "Бердичев",
    lat: "49.903381",
    lng: "28.599251"
  },
  {
    label: "Житомир",
    lat: "50.259749",
    lng: "28.676248"
  },
  {
    label: "Коростень",
    lat: "50.95",
    lng: "28.6333333"
  },
  {
    label: "Коростышев",
    lat: "50.316639",
    lng: "29.06653"
  },
  {
    label: "Малин",
    lat: "50.77121",
    lng: "29.25297"
  },
  {
    label: "Новоград-Волынский",
    lat: "50.59256",
    lng: "27.62348"
  },
  {
    label: "Овруч",
    lat: "51.327251",
    lng: "28.818979"
  },
  {
    label: "Радомышль",
    lat: "50.4947222",
    lng: "29.2333333"
  },
  {
    label: "Берегово",
    lat: "48.2",
    lng: "22.6333333"
  },
  {
    label: "Виноградов",
    lat: "48.138142",
    lng: "23.041519"
  },
  {
    label: "Иршава",
    lat: "48.310911",
    lng: "23.037711"
  },
  {
    label: "Мукачево",
    lat: "48.442411",
    lng: "22.723352"
  },
  {
    label: "Перечин",
    lat: "48.7341667",
    lng: "22.4741667"
  },
  {
    label: "Рахов",
    lat: "48.060829",
    lng: "24.205059"
  },
  {
    label: "Свалява",
    lat: "48.5472222",
    lng: "22.9861111"
  },
  {
    label: "Тячев",
    lat: "48.0113889",
    lng: "23.5722222"
  },
  {
    label: "Ужгород",
    lat: "48.6166667",
    lng: "22.3"
  },
  {
    label: "Хуст",
    lat: "48.1813889",
    lng: "23.2977778"
  },
  {
    label: "Чоп",
    lat: "48.4333333",
    lng: "22.2"
  },
  {
    label: "Бердянск",
    lat: "46.748581",
    lng: "36.809502"
  },
  {
    label: "Васильевка",
    lat: "47.433708",
    lng: "35.27816"
  },
  {
    label: "Вольнянск",
    lat: "47.9419444",
    lng: "35.4280556"
  },
  {
    label: "Гуляйполе",
    lat: "47.658562",
    lng: "36.252918"
  },
  {
    label: "Днепрорудное",
    lat: "47.3840983",
    lng: "34.98121"
  },
  {
    label: "Запорожье",
    lat: "47.853748",
    lng: "35.157139"
  },
  {
    label: "Каменка-Днепровская",
    lat: "47.488911",
    lng: "34.400761"
  },
  {
    label: "Мелитополь",
    lat: "46.847839",
    lng: "35.364979"
  },
  {
    label: "Молочанск",
    lat: "47.206982",
    lng: "35.59618"
  },
  {
    label: "Орехов",
    lat: "47.5666667",
    lng: "35.7833333"
  },
  {
    label: "Пологи",
    lat: "47.47728",
    lng: "36.25626"
  },
  {
    label: "Приморск",
    lat: "46.7333333",
    lng: "36.35"
  },
  {
    label: "Токмак",
    lat: "47.25",
    lng: "35.7"
  },
  {
    label: "Энергодар",
    lat: "47.4979877",
    lng: "34.6565334"
  },
  {
    label: "Болехов",
    lat: "49.070011",
    lng: "23.864719"
  },
  {
    label: "Бурштын",
    lat: "49.263802",
    lng: "24.634211"
  },
  {
    label: "Галич",
    lat: "49.1247222",
    lng: "24.7286111"
  },
  {
    label: "Городенка",
    lat: "48.6675",
    lng: "25.5002778"
  },
  {
    label: "Долина",
    lat: "51.79",
    lng: "33.76"
  },
  {
    label: "Ивано-Франковск",
    lat: "48.9166667",
    lng: "24.7166667"
  },
  {
    label: "Калуш",
    lat: "49.050465",
    lng: "24.374117"
  },
  {
    label: "Коломыя",
    lat: "48.53146",
    lng: "25.039709"
  },
  {
    label: "Косов",
    lat: "48.315",
    lng: "25.0952778"
  },
  {
    label: "Надворная",
    lat: "48.6333333",
    lng: "24.5833333"
  },
  {
    label: "Рогатин",
    lat: "49.411449",
    lng: "24.62051"
  },
  {
    label: "Снятын",
    lat: "48.45",
    lng: "25.5666667"
  },
  {
    label: "Тысменица",
    lat: "48.9008333",
    lng: "24.8491667"
  },
  {
    label: "Тлумач",
    lat: "48.8666667",
    lng: "25.0"
  },
  {
    label: "Яремче",
    lat: "48.449523",
    lng: "24.557508"
  },
  {
    label: "Белая Церковь",
    lat: "49.7988889",
    lng: "30.1152778"
  },
  {
    label: "Березань",
    lat: "50.3197222",
    lng: "31.47"
  },
  {
    label: "Богуслав",
    lat: "49.541031",
    lng: "30.88073"
  },
  {
    label: "Борисполь",
    lat: "50.350491",
    lng: "30.960739"
  },
  {
    label: "Боярка",
    lat: "49.323518",
    lng: "30.700165"
  },
  {
    label: "Бровары",
    lat: "50.5166667",
    lng: "30.8166667"
  },
  {
    label: "Буча",
    lat: "50.5569165",
    lng: "30.2230733"
  },
  {
    label: "Васильков",
    lat: "50.178959",
    lng: "30.32715"
  },
  {
    label: "Вишнёвое",
    lat: "50.4377778",
    lng: "33.3822222"
  },
  {
    label: "Вышгород",
    lat: "50.5833333",
    lng: "30.5"
  },
  {
    label: "Ирпень",
    lat: "50.5166667",
    lng: "30.25"
  },
  {
    label: "Кагарлык",
    lat: "49.85722",
    lng: "30.82032"
  },
  {
    label: "Киев",
    lat: "50.584981",
    lng: "30.235748"
  },
  {
    label: "Мироновка",
    lat: "49.661022",
    lng: "30.98458"
  },
  {
    label: "Обухов",
    lat: "50.105728",
    lng: "30.630699"
  },
  {
    label: "Переяслав-Хмельницкий",
    lat: "50.070141",
    lng: "31.45775"
  },
  {
    label: "Припять",
    lat: "51.4977778",
    lng: "24.1180556"
  },
  {
    label: "Ржищев",
    lat: "49.972801",
    lng: "31.04777"
  },
  {
    label: "Сквира",
    lat: "49.73719",
    lng: "29.66901"
  },
  {
    label: "Славутич",
    lat: "51.523777",
    lng: "30.768559"
  },
  {
    label: "Тараща",
    lat: "49.56065",
    lng: "30.510309"
  },
  {
    label: "Тетиев",
    lat: "49.370575",
    lng: "29.680221"
  },
  {
    label: "Узин",
    lat: "49.820228",
    lng: "30.438929"
  },
  {
    label: "Украинка",
    lat: "50.1530861",
    lng: "30.7434917"
  },
  {
    label: "Фастов",
    lat: "50.0833333",
    lng: "29.9166667"
  },
  {
    label: "Чернобыль",
    lat: "51.2666667",
    lng: "30.2166667"
  },
  {
    label: "Яготин",
    lat: "50.244949",
    lng: "31.796261"
  },
  {
    label: "Александрия",
    lat: "48.6666667",
    lng: "33.1166667"
  },
  {
    label: "Бобринец",
    lat: "48.050861",
    lng: "32.16589"
  },
  {
    label: "Гайворон",
    lat: "48.3333333",
    lng: "29.8666667"
  },
  {
    label: "Долинская",
    lat: "48.1108333",
    lng: "32.7647222"
  },
  {
    label: "Знаменка",
    lat: "48.7166667",
    lng: "32.6666667"
  },
  {
    label: "Кировоград",
    lat: "48.508389",
    lng: "32.264801"
  },
  {
    label: "Малая Виска",
    lat: "48.65",
    lng: "31.6333333"
  },
  {
    label: "Новомиргород",
    lat: "48.7833333",
    lng: "31.65"
  },
  {
    label: "Новоукраинка",
    lat: "48.3155556",
    lng: "31.5269444"
  },
  {
    label: "Светловодск",
    lat: "49.0502778",
    lng: "33.2419444"
  },
  {
    label: "Александровск",
    lat: "48.5861652",
    lng: "39.1949396"
  },
  {
    label: "Алмазная",
    lat: "48.5166667",
    lng: "38.5833333"
  },
  {
    label: "Алчевск",
    lat: "48.4666667",
    lng: "38.8"
  },
  {
    label: "Антрацит",
    lat: "48.1166667",
    lng: "39.0833333"
  },
  {
    label: "Брянка",
    lat: "48.5133333",
    lng: "38.6430556"
  },
  {
    label: "Вахрушево",
    lat: "48.174579",
    lng: "38.837224"
  },
  {
    label: "Горное",
    lat: "49.1805556",
    lng: "23.7341667"
  },
  {
    label: "Зимогорье",
    lat: "48.5833333",
    lng: "38.9333333"
  },
  {
    label: "Золотое",
    lat: "48.6928568",
    lng: "38.5146349"
  },
  {
    label: "Зоринск",
    lat: "48.4131636",
    lng: "38.6204799"
  },
  {
    label: "Краснодон",
    lat: "48.29607",
    lng: "39.745239"
  },
  {
    label: "Красный Луч",
    lat: "48.134041",
    lng: "38.931419"
  },
  {
    label: "Лисичанск",
    lat: "48.896895",
    lng: "38.444143"
  },
  {
    label: "Луганск",
    lat: "48.573269",
    lng: "39.355659"
  },
  {
    label: "Лутугино",
    lat: "48.4019444",
    lng: "39.2102778"
  },
  {
    label: "Миусинск",
    lat: "48.07",
    lng: "38.9"
  },
  {
    label: "Молодогвардейск",
    lat: "48.3444444",
    lng: "39.6583333"
  },
  {
    label: "Новодружеск",
    lat: "48.9666667",
    lng: "38.35"
  },
  {
    label: "Новопсков",
    lat: "49.544731",
    lng: "39.103889"
  },
  {
    label: "Первомайск",
    lat: "48.05",
    lng: "30.85"
  },
  {
    label: "Перевальск",
    lat: "48.4388889",
    lng: "38.8194444"
  },
  {
    label: "Петровское",
    lat: "48.293331",
    lng: "38.888614"
  },
  {
    label: "Попасная",
    lat: "48.6333333",
    lng: "38.38"
  },
  {
    label: "Приволье",
    lat: "49.016706",
    lng: "38.302668"
  },
  {
    label: "Ровеньки",
    lat: "48.0833333",
    lng: "39.3666667"
  },
  {
    label: "Рубежное",
    lat: "49.0166667",
    lng: "38.3666667"
  },
  {
    label: "Сватово",
    lat: "49.41011",
    lng: "38.15258"
  },
  {
    label: "Свердловск",
    lat: "48.084549",
    lng: "39.65163"
  },
  {
    label: "Северодонецк",
    lat: "48.950191",
    lng: "38.497631"
  },
  {
    label: "Старобельск",
    lat: "49.2666667",
    lng: "38.9166667"
  },
  {
    label: "Стаханов",
    lat: "48.5666667",
    lng: "38.65"
  },
  {
    label: "Суходольск",
    lat: "48.3523068",
    lng: "39.7239205"
  },
  {
    label: "Счастье",
    lat: "48.737247",
    lng: "39.2311974"
  },
  {
    label: "Теплогорск",
    lat: "48.600487",
    lng: "38.5920825"
  },
  {
    label: "Червонопартизанск",
    lat: "48.095566",
    lng: "39.759607"
  },
  {
    label: "Белз",
    lat: "50.380501",
    lng: "24.01269"
  },
  {
    label: "Бобрка",
    lat: "49.6331904",
    lng: "24.2907476"
  },
  {
    label: "Борислав",
    lat: "49.28476",
    lng: "23.42137"
  },
  {
    label: "Броды",
    lat: "50.0833333",
    lng: "25.15"
  },
  {
    label: "Буск",
    lat: "49.9666667",
    lng: "24.6333333"
  },
  {
    label: "Великие Мосты",
    lat: "50.24",
    lng: "24.1394444"
  },
  {
    label: "Глиняны",
    lat: "49.8233333",
    lng: "24.5166667"
  },
  {
    label: "Городок",
    lat: "49.1666667",
    lng: "26.5666667"
  },
  {
    label: "Добромиль",
    lat: "49.5666667",
    lng: "22.7833333"
  },
  {
    label: "Дрогобыч",
    lat: "49.34853",
    lng: "23.51647"
  },
  {
    label: "Дубляны",
    lat: "49.8833333",
    lng: "24.0833333"
  },
  {
    label: "Жидачов",
    lat: "49.3813889",
    lng: "24.1408333"
  },
  {
    label: "Жолква",
    lat: "50.0666667",
    lng: "23.9666667"
  },
  {
    label: "Золочев",
    lat: "49.8083333",
    lng: "24.9011111"
  },
  {
    label: "Каменка-Бугская",
    lat: "50.1",
    lng: "24.35"
  },
  {
    label: "Львов",
    lat: "49.85",
    lng: "24.0166667"
  },
  {
    label: "Мостиска",
    lat: "49.7941667",
    lng: "23.1525"
  },
  {
    label: "Перемышляны",
    lat: "49.67",
    lng: "24.5594444"
  },
  {
    label: "Пустомыты",
    lat: "49.7138889",
    lng: "23.9108333"
  },
  {
    label: "Рава-Русская",
    lat: "50.230431",
    lng: "23.628309"
  },
  {
    label: "Радехов",
    lat: "50.2827778",
    lng: "24.6375"
  },
  {
    label: "Рудки",
    lat: "49.6530556",
    lng: "23.4880556"
  },
  {
    label: "Самбор",
    lat: "49.5166667",
    lng: "23.2027778"
  },
  {
    label: "Сколе",
    lat: "49.036049",
    lng: "23.51232"
  },
  {
    label: "Сокаль",
    lat: "50.4833333",
    lng: "24.2833333"
  },
  {
    label: "Старый Самбор",
    lat: "49.4430556",
    lng: "23.0033333"
  },
  {
    label: "Стрый",
    lat: "49.256171",
    lng: "23.850306"
  },
  {
    label: "Трускавец",
    lat: "49.2805556",
    lng: "23.505"
  },
  {
    label: "Угнев",
    lat: "50.3666667",
    lng: "23.7444444"
  },
  {
    label: "Хыров",
    lat: "49.5333333",
    lng: "22.85"
  },
  {
    label: "Червоноград",
    lat: "50.3833333",
    lng: "24.2333333"
  },
  {
    label: "Яворов",
    lat: "49.942501",
    lng: "23.390989"
  },
  {
    label: "Баштанка",
    lat: "47.404331",
    lng: "32.445301"
  },
  {
    label: "Вознесенск",
    lat: "47.587711",
    lng: "31.336"
  },
  {
    label: "Николаев",
    lat: "46.9666667",
    lng: "32.0"
  },
  {
    label: "Новая Одесса",
    lat: "47.3166667",
    lng: "31.7833333"
  },
  {
    label: "Новый Буг",
    lat: "47.6833333",
    lng: "32.5"
  },
  {
    label: "Очаков",
    lat: "46.6166667",
    lng: "31.55"
  },
  {
    label: "Первомайск",
    lat: "48.05",
    lng: "30.85"
  },
  {
    label: "Снигирёвка",
    lat: "47.0666667",
    lng: "32.8166667"
  },
  {
    label: "Южноукраинск",
    lat: "47.8166667",
    lng: "31.1833333"
  },
  {
    label: "Ананьев",
    lat: "47.7173",
    lng: "29.975639"
  },
  {
    label: "Арциз",
    lat: "45.99739",
    lng: "29.431288"
  },
  {
    label: "Балта",
    lat: "47.9333333",
    lng: "29.6166667"
  },
  {
    label: "Белгород-Днестровский",
    lat: "46.1833333",
    lng: "30.3333333"
  },
  {
    label: "Болград",
    lat: "45.682701",
    lng: "28.61935"
  },
  {
    label: "Измаил",
    lat: "45.3516667",
    lng: "28.8363889"
  },
  {
    label: "Ильичёвск",
    lat: "46.3020534",
    lng: "30.6517391"
  },
  {
    label: "Килия",
    lat: "45.45578",
    lng: "29.273291"
  },
  {
    label: "Кодыма",
    lat: "48.093941",
    lng: "29.13368"
  },
  {
    label: "Котовск",
    lat: "47.75",
    lng: "29.5333333"
  },
  {
    label: "Одесса",
    lat: "46.4666667",
    lng: "30.7333333"
  },
  {
    label: "Татарбунары",
    lat: "45.841418",
    lng: "29.62284"
  },
  {
    label: "Теплодар",
    lat: "46.5",
    lng: "30.3333333"
  },
  {
    label: "Южное",
    lat: "47.8173262",
    lng: "33.5737487"
  },
  {
    label: "Гадяч",
    lat: "50.3666667",
    lng: "34.0"
  },
  {
    label: "Глобино",
    lat: "49.3833333",
    lng: "33.2833333"
  },
  {
    label: "Гребёнка",
    lat: "50.116852",
    lng: "32.44059"
  },
  {
    label: "Зеньков",
    lat: "50.20955",
    lng: "34.362345"
  },
  {
    label: "Карловка",
    lat: "49.45",
    lng: "35.1333333"
  },
  {
    label: "Кременчуг",
    lat: "49.073521",
    lng: "33.4231"
  },
  {
    label: "Кобеляки",
    lat: "49.145439",
    lng: "34.213638"
  },
  {
    label: "Комсомольск",
    lat: "49.013756",
    lng: "33.643381"
  },
  {
    label: "Лохвица",
    lat: "50.36319",
    lng: "33.253288"
  },
  {
    label: "Лубны",
    lat: "50.0166667",
    lng: "33.0"
  },
  {
    label: "Миргород",
    lat: "49.963799",
    lng: "33.61869"
  },
  {
    label: "Пирятин",
    lat: "50.23975",
    lng: "32.514309"
  },
  {
    label: "Полтава",
    lat: "49.59269",
    lng: "34.551159"
  },
  {
    label: "Хорол",
    lat: "49.790279",
    lng: "33.207809"
  },
  {
    label: "Червонозаводское",
    lat: "50.4",
    lng: "33.4"
  },
  {
    label: "Березне",
    lat: "51.0",
    lng: "26.75"
  },
  {
    label: "Дубно",
    lat: "50.38738",
    lng: "25.754559"
  },
  {
    label: "Дубровица",
    lat: "51.571209",
    lng: "26.56805"
  },
  {
    label: "Здолбунов",
    lat: "50.5166667",
    lng: "26.25"
  },
  {
    label: "Корец",
    lat: "50.619129",
    lng: "27.161869"
  },
  {
    label: "Костополь",
    lat: "50.8833333",
    lng: "26.45"
  },
  {
    label: "Кузнецовск",
    lat: "51.3436553",
    lng: "25.8490867"
  },
  {
    label: "Острог",
    lat: "50.3333333",
    lng: "26.5166667"
  },
  {
    label: "Радивилов",
    lat: "50.125777",
    lng: "25.264195"
  },
  {
    label: "Ровно",
    lat: "50.6166667",
    lng: "26.25"
  },
  {
    label: "Сарны",
    lat: "51.3372222",
    lng: "26.6058333"
  },
  {
    label: "Ахтырка",
    lat: "50.29855",
    lng: "34.892052"
  },
  {
    label: "Белополье",
    lat: "51.149402",
    lng: "34.3175225"
  },
  {
    label: "Бурынь",
    lat: "51.1978",
    lng: "33.847351"
  },
  {
    label: "Глухов",
    lat: "51.6786111",
    lng: "33.9113889"
  },
  {
    label: "Кролевец",
    lat: "51.550121",
    lng: "33.38279"
  },
  {
    label: "Конотоп",
    lat: "51.237469",
    lng: "33.21217"
  },
  {
    label: "Лебедин",
    lat: "48.96",
    lng: "31.52"
  },
  {
    label: "Путивль",
    lat: "51.337589",
    lng: "33.87888"
  },
  {
    label: "Ромны",
    lat: "50.743919",
    lng: "33.475712"
  },
  {
    label: "Середина-Буда",
    lat: "52.1833333",
    lng: "34.0333333"
  },
  {
    label: "Сумы",
    lat: "50.910561",
    lng: "34.80566"
  },
  {
    label: "Тростянец",
    lat: "50.9599282",
    lng: "25.55378"
  },
  {
    label: "Шостка",
    lat: "51.86282",
    lng: "33.487831"
  },
  {
    label: "Бережаны",
    lat: "49.444191",
    lng: "24.94486"
  },
  {
    label: "Борщёв",
    lat: "48.803181",
    lng: "26.041809"
  },
  {
    label: "Бучач",
    lat: "49.05772",
    lng: "25.401979"
  },
  {
    label: "Залещики",
    lat: "48.65",
    lng: "25.7333333"
  },
  {
    label: "Збараж",
    lat: "49.6666667",
    lng: "25.7777778"
  },
  {
    label: "Зборов",
    lat: "49.660696",
    lng: "25.1434667"
  },
  {
    label: "Кременец",
    lat: "50.099129",
    lng: "25.7328"
  },
  {
    label: "Лановцы",
    lat: "49.8659402",
    lng: "26.0841931"
  },
  {
    label: "Монастыриска",
    lat: "49.0888889",
    lng: "25.1694444"
  },
  {
    label: "Подволочиск",
    lat: "49.5246859",
    lng: "26.137326"
  },
  {
    label: "Подгайцы",
    lat: "49.2694444",
    lng: "25.1361111"
  },
  {
    label: "Почаев",
    lat: "50.0",
    lng: "25.5083333"
  },
  {
    label: "Скалат",
    lat: "49.424214",
    lng: "25.976246"
  },
  {
    label: "Тернополь",
    lat: "49.551361",
    lng: "25.603979"
  },
  {
    label: "Теребовля",
    lat: "49.29348",
    lng: "25.699551"
  },
  {
    label: "Чортков",
    lat: "49.0166667",
    lng: "25.8"
  },
  {
    label: "Шумск",
    lat: "50.122577",
    lng: "26.1149716"
  },
  {
    label: "Балаклея",
    lat: "49.4658333",
    lng: "36.8677778"
  },
  {
    label: "Барвенково",
    lat: "48.9",
    lng: "37.0166667"
  },
  {
    label: "Богодухов",
    lat: "50.1654302",
    lng: "35.5267251"
  },
  {
    label: "Валки",
    lat: "49.843601",
    lng: "35.61388"
  },
  {
    label: "Великий Бурлук",
    lat: "50.0455556",
    lng: "37.3905556"
  },
  {
    label: "Волчанск",
    lat: "50.278519",
    lng: "36.945171"
  },
  {
    label: "Дергачи",
    lat: "50.110668",
    lng: "36.114361"
  },
  {
    label: "Змиев",
    lat: "49.701939",
    lng: "36.355171"
  },
  {
    label: "Изюм",
    lat: "49.2127778",
    lng: "37.2569444"
  },
  {
    label: "Красноград",
    lat: "49.3666667",
    lng: "35.45"
  },
  {
    label: "Купянск",
    lat: "49.721901",
    lng: "37.624329"
  },
  {
    label: "Лозовая",
    lat: "48.891684",
    lng: "36.325786"
  },
  {
    label: "Люботин",
    lat: "49.95",
    lng: "35.9166667"
  },
  {
    label: "Мерефа",
    lat: "49.8166667",
    lng: "36.05"
  },
  {
    label: "Первомайский",
    lat: "49.3833333",
    lng: "36.2166667"
  },
  {
    label: "Харьков",
    lat: "49.98967",
    lng: "36.208309"
  },
  {
    label: "Чугуев",
    lat: "49.8355556",
    lng: "36.6863889"
  },
  {
    label: "Берислав",
    lat: "46.843822",
    lng: "33.4375"
  },
  {
    label: "Геническ",
    lat: "46.171638",
    lng: "34.80777"
  },
  {
    label: "Голая Пристань",
    lat: "46.5166667",
    lng: "32.5166667"
  },
  {
    label: "Каховка",
    lat: "46.817388",
    lng: "33.494325"
  },
  {
    label: "Новая Каховка",
    lat: "46.7666667",
    lng: "33.3666667"
  },
  {
    label: "Скадовск",
    lat: "46.116871",
    lng: "32.913731"
  },
  {
    label: "Таврийск",
    lat: "46.7528018",
    lng: "33.4216856"
  },
  {
    label: "Херсон",
    lat: "46.653368",
    lng: "32.629424"
  },
  {
    label: "Цюрупинск",
    lat: "46.62",
    lng: "32.72"
  },
  {
    label: "Волочиск",
    lat: "49.535179",
    lng: "26.22331"
  },
  {
    label: "Городок",
    lat: "49.1666667",
    lng: "26.5666667"
  },
  {
    label: "Деражня",
    lat: "49.267071",
    lng: "27.440269"
  },
  {
    label: "Дунаевцы",
    lat: "48.8909743",
    lng: "26.8546608"
  },
  {
    label: "Изяслав",
    lat: "50.119221",
    lng: "26.82629"
  },
  {
    label: "Каменец-Подольский",
    lat: "48.6833333",
    lng: "26.5833333"
  },
  {
    label: "Красилов",
    lat: "49.6519444",
    lng: "26.9705556"
  },
  {
    label: "Нетешин",
    lat: "50.3374232",
    lng: "26.6404529"
  },
  {
    label: "Полонное",
    lat: "50.122269",
    lng: "27.511909"
  },
  {
    label: "Славута",
    lat: "49.0563905",
    lng: "27.3944506"
  },
  {
    label: "Староконстантинов",
    lat: "49.7555556",
    lng: "27.2208333"
  },
  {
    label: "Хмельницкий",
    lat: "49.4166667",
    lng: "27.0"
  },
  {
    label: "Шепетовка",
    lat: "50.179131",
    lng: "27.07732"
  },
  {
    label: "Ватутино",
    lat: "49.0166667",
    lng: "31.0666667"
  },
  {
    label: "Городище",
    lat: "49.290649",
    lng: "31.443199"
  },
  {
    label: "Жашков",
    lat: "49.245522",
    lng: "30.11998"
  },
  {
    label: "Звенигородка",
    lat: "49.075489",
    lng: "30.967911"
  },
  {
    label: "Золотоноша",
    lat: "49.674271",
    lng: "32.040421"
  },
  {
    label: "Каменка",
    lat: "49.036347",
    lng: "32.103481"
  },
  {
    label: "Канев",
    lat: "49.75",
    lng: "31.4666667"
  },
  {
    label: "Корсунь-Шевченковский",
    lat: "49.421051",
    lng: "31.268993"
  },
  {
    label: "Монастырище",
    lat: "48.9909154",
    lng: "29.8051363"
  },
  {
    label: "Смела",
    lat: "49.224621",
    lng: "31.878401"
  },
  {
    label: "Тальное",
    lat: "48.8833333",
    lng: "30.7"
  },
  {
    label: "Умань",
    lat: "48.75",
    lng: "30.2166667"
  },
  {
    label: "Христиновка",
    lat: "48.8494444",
    lng: "29.97"
  },
  {
    label: "Черкассы",
    lat: "49.4333333",
    lng: "32.0666667"
  },
  {
    label: "Чигирин",
    lat: "49.072498",
    lng: "32.683578"
  },
  {
    label: "Шпола",
    lat: "49.00349",
    lng: "31.385559"
  },
  {
    label: "Бахмач",
    lat: "51.1830556",
    lng: "32.8297222"
  },
  {
    label: "Бобровица",
    lat: "50.745",
    lng: "31.3869444"
  },
  {
    label: "Борзна",
    lat: "51.249451",
    lng: "32.43034"
  },
  {
    label: "Городня",
    lat: "51.8905556",
    lng: "31.5936111"
  },
  {
    label: "Десна",
    lat: "50.9246667",
    lng: "30.756"
  },
  {
    label: "Ичня",
    lat: "50.863918",
    lng: "32.39307"
  },
  {
    label: "Корюковка",
    lat: "51.7754831",
    lng: "32.2595792"
  },
  {
    label: "Мена",
    lat: "51.521759",
    lng: "32.21888"
  },
  {
    label: "Нежин",
    lat: "51.0380556",
    lng: "31.8861111"
  },
  {
    label: "Новгород-Северский",
    lat: "52.0069896",
    lng: "33.2537069"
  },
  {
    label: "Носовка",
    lat: "50.9333333",
    lng: "31.5833333"
  },
  {
    label: "Прилуки",
    lat: "50.594181",
    lng: "32.38689"
  },
  {
    label: "Седнев",
    lat: "51.6463023",
    lng: "31.5616846"
  },
  {
    label: "Семёновка",
    lat: "52.173561",
    lng: "32.587059"
  },
  {
    label: "Чернигов",
    lat: "51.503653",
    lng: "31.293167"
  },
  {
    label: "Щорс",
    lat: "51.819321",
    lng: "31.94846"
  },
  {
    label: "Вашковцы",
    lat: "48.38",
    lng: "25.51"
  },
  {
    label: "Вижница",
    lat: "48.25",
    lng: "25.1916667"
  },
  {
    label: "Герца",
    lat: "48.1485764",
    lng: "26.2572996"
  },
  {
    label: "Заставна",
    lat: "48.5166667",
    lng: "25.85"
  },
  {
    label: "Кицмань",
    lat: "48.4425",
    lng: "25.7613889"
  },
  {
    label: "Новоднестровск",
    lat: "48.5833333",
    lng: "27.4333333"
  },
  {
    label: "Новоселица",
    lat: "48.2166667",
    lng: "26.2666667"
  },
  {
    label: "Сокиряны",
    lat: "48.45",
    lng: "27.4166667"
  },
  {
    label: "Сторожинец",
    lat: "48.1666667",
    lng: "25.7166667"
  },
  {
    label: "Хотин",
    lat: "48.5",
    lng: "26.5"
  },
  {
    label: "Черновцы",
    lat: "48.3",
    lng: "25.9333333"
  }
];
